[
    {
        "Author": "Paxton",
        "Date": "Reviewed in the United States on January 6, 2024",
        "Rating": "3.0 out of 5 stars",
        "Review Body": "This is a pretty standard monitor and it does everything any other monitor does except for the fact that it will randomly go black for a second and then cut back on frequently. It also will completely turn off and i have to unplug it from the wall and plug it back in pretty frequently. Although this isn't too big of a deal, it's very annoying. I've tried to solve this by using different HDMI cords and a different computer but it continues, so it must be a problem with the monitor itself. It has been happening ever since I bought it less than a year ago. Even while I was typing this review it blanked out twice. Some days are worse than others but today i have been using it for about 2 hours and it probably has blanked 20-30 times."
    },
    {
        "Author": "notdoc",
        "Date": "Reviewed in the United States on January 1, 2024",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "General use monitor.  27\" curve model. Was a little difficulty setting up via a toggle switch on back.  Maybe just me.  The instructions are pictorial & poor to none written.  After up & running, is performing flawlessly"
    },
    {
        "Author": "HoneyB’s Finds",
        "Date": "Reviewed in the United States on December 26, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "I have no idea how I worked without a monitor like this. I love the size and the curve of it. I bought an arm to lift it off my desk also and it’s the perfect combo. You can also change the settings on the monitor as well (to adjust the day/night settings, sharpness, ect). Works great with my Mac! And so easy to set up!"
    },
    {
        "Author": "Al Chew",
        "Date": "Reviewed in the United States on December 24, 2023",
        "Rating": "3.0 out of 5 stars",
        "Review Body": "The value is great for a 27\" screen for my home office. Only gripes I have is that I ordered a 27\" curved screen with HDMI and DP, but I received one with HDMI and VGA."
    },
    {
        "Author": "maurice Nickelson",
        "Date": "Reviewed in the United States on December 19, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "PICTURE QUALITY IS OK, BUT IS WHAT WAS EXPECTED FOR THE SPECS AND PRICE.  I LIKE THE CURVE. NICE SIZE, DOES WHAT IS NEEDED, GOOD PURCHASE.  I MAY RETURN ONLY BECAUSE I WAS A BIGGER MONITOR TO BE MORE SIMILAR IN SIZE TO MY IMAC 27"
    },
    {
        "Author": "Vie",
        "Date": "Reviewed in the United States on December 18, 2023",
        "Rating": "2.0 out of 5 stars",
        "Review Body": "Great look and barely used, only used for 3 months in the 1 year and a half I had it. Half the screen went dead after a year and a half. It was only moved once from my office to my house and now is glitched/won’t work on one side of the screen."
    },
    {
        "Author": "Jay",
        "Date": "Reviewed in the United States on December 15, 2023",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "To remove the base of the stand mount, you literally have to disassemble the monitor! I bought this to use on a tilting mount, as my chair sits lower than the monitor, and the base of the stand hits the post that I mounted it to, preventing ANY downward tilt. I literally have to choose between disassembling the monitor and cutting it off with a hack saw. Ridiculous design..."
    },
    {
        "Author": "Mare M",
        "Date": "Reviewed in the United States on December 9, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "I've been using two monitors for years. When I purchased a 27-inch all-in-one a few years ago, I replaced a desktop with two 24-inch monitors. I purchased another brand 27-inch monitor that started blacking out just after the return window closed. I put up with it for a couple of years and decided to replace it with a, hopefully, more dependable model.It took about 5 minutes, after unpacking, to have it up and running. Slip the riser into the stand, tighten the screw, slip the monitor on the riser, plug in the HDMI and power cables, and set it up in your display settings. That's all there is to it. Couldn't be easier. I'm not using the eye saver mode, I have an app I'm already using for that, so I can't comment on the monitor app. The curve isn't dramatic. It's just a slight curve and it actually does make a difference, compared to a flat screen. I can't really fully explain it, but it makes it easier to focus your eyes on the web page. You can pretty much view the entire page without moving your head, or even your eyes, much. The image quality is excellent, bringing even small details and print into full focus.Note: I paid an excellent price when I purchased this monitor on December 3rd. The price has raised three times since I made my purchase. If you aren't planning on purchasing this monitor as a Christmas gift, you may want to wait until after Christmas to see if the price drops back down."
    },
    {
        "Author": "SuburbanHubby",
        "Date": "Reviewed in the United States on December 5, 2023",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "tl;dr - The \"DP/HDMI 3-Yr Warranty\" version (C27F390FHN) only has VGA and HDMI, not DisplayPort.I've had one Samsung 27\" curved monitor with DisplayPort and HDMI for a few years and wanted to get a second monitor that also had DisplayPort. This was the closest current model I found. I selected the \"DP/HDMI 3-Yr Warranty\" version (C27F390FHN). I didn't care about the warranty, but it was the same price ($129) as the \"DP/HDMI\" version without the extra warranty, and that version could not be delivered to me for some reason, anyway. When I received the monitor, it was the correct model, but it only had a VGA port and an HDMI port. I still used it because it I could still use the HDMI and it wasn't worth returning. It works and looks fine. Just bothered that the listing info was inaccurate."
    },
    {
        "Author": "WonderWomanRules",
        "Date": "Reviewed in the United States on October 20, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "I love this monitor! I started with two because of how much I use my computer - then I added a third one. But my work requires me to have so many applications open at once that I finally broke down and I just got a fourth one. I could not be happier with my set up. It is so great! I highly recommend! If I could fit another monitor, I would do it; honestly, these are wonderful.  Great picture quality and no flickering ever.As a helpful tip for those interested in a quad set up. . . I first tried setting up my four monitors with two double monitor stands, but I ended up returning those and purchased four separate single monitor stands. That was the ideal solution; they fit perfectly! (FYI, my desk measures 66.5 inches long. This set up with work on a smaller desk, but you would have more overhang on the outer two monitors, plan accordingly). Good luck!!"
    },
    {
        "Author": "Dhruv Chadha",
        "Date": "Reviewed in the United States on October 15, 2023",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "This is the most unreliable screen ever at such a high price. The HDMI cable that came with the monitor did not even work and the monitor stayed black. I used an old HDMI-Analog cable I had but that too didn't work for long. Samsung is just pathetic and the customer service is as good as non-existent. $170 down the drain. If Samsung cares two hoots about product quality and customer service, they will reach out to me."
    },
    {
        "Author": "Amazon Customer",
        "Date": "Reviewed in the United States on October 13, 2023",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "Too pixelated, hurt eyes and needed to return."
    },
    {
        "Author": "Gramps gigi",
        "Date": "Reviewed in the United States on September 19, 2023",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "I would have selected 5 stars,unfortunately I didn't realize the monitor didn't have a camera 😳.  Otherwise very nice monitor."
    },
    {
        "Author": "Roberta L",
        "Date": "Reviewed in the United States on September 9, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "I wasn’t sure about the curved monitor, but I’m so glad I went for it. The curvature feels very natural when working on the computer screen- you won’t notice it after a few minutes (or after having the monitor for a while!I’m a medical student, so I often spend long hours staring at my computer screen. My eyes feel less strained since switching to this monitor- perhaps it’s the large size, or the large curvature… regardless, I recommend it."
    },
    {
        "Author": "Dan8lly",
        "Date": "Reviewed in the United States on September 2, 2023",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "Very flimsy connection to hdmi cables. Monitor does not work"
    },
    {
        "Author": "Jodi",
        "Date": "Reviewed in the United States on August 22, 2023",
        "Rating": "2.0 out of 5 stars",
        "Review Body": "Well after receiving my monitor 3 days past when it was promised during my purchase readback - I finally get it and its defective (great, right?!)  The toggling feature on the back of screen for the menu/settings doesnt work when toggling up or to the right so any settings I can get to I can only toggle to the left vs right.  Contacted Samsung directly - very nice process for no fee - and checked to ensure it wasnt user error.  They send you a link to allow you to aim your phone at your screen so they can see what is occurring - after she put me on hold they determined its a defect.  The hiccup for me is that it could take a \"long time\" per the rep before they could fix and return.  It also meant that i had to print the label and bring it to the post office - with no printer however its useless since they have no other option.  Obviously, I went by way of returning it to Amazon with no label needed - yaay!  The other thing I found out is using my model and serial number she advised me there is only a 1 year warranty not 3 yr as it states in the description on Amazon.  I inquired about it and she wasnt sure how this could be - if anyone understands how that works feel free to comment as I'm unsure as well.  Now, I LOVE Samsung and never have any issues with their products but this one issue bugged due to the timing of delivery by Amazon then its defective and now the only option is returning it to Amazon and trying all over again - I wish there was a simpler way."
    },
    {
        "Author": "Mr. J",
        "Date": "Reviewed in the United States on July 28, 2023",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "The Samsung CF390 Series 27-inch FHD Curved Desktop Monitor for Business has proven to be an excellent addition to my workspace. Its immersive curved design, coupled with FHD 1920x1080 resolution, provides a captivating viewing experience that truly enhances productivity and enjoyment.Setting up the monitor was a breeze, thanks to the HDMI and VGA connectivity options and its VESA mountable design. It seamlessly integrated with my existing setup, allowing me to start using it right away without any technical hassles.The curved display is the standout feature of this monitor. It adds depth and dimension to visuals, creating a more engaging and realistic feel when working or enjoying multimedia content. The wide 178-degree viewing angles ensure consistent image quality from various positions, making it ideal for collaborative projects or presentations.I appreciate Samsung's inclusion of a 3-year warranty and TAA compliance, offering peace of mind and assurance of the product's quality and longevity. The monitor's sleek black finish adds a touch of elegance to my workspace, contributing to a professional and modern aesthetic.While the overall performance is commendable, I would have liked to see some additional ergonomic features, such as height adjustability or swivel options, to cater to various user preferences and enhance comfort during extended use.In conclusion, the Samsung CF390 Series 27-inch FHD Curved Desktop Monitor is an excellent choice for both business and personal use. Its immersive curved display, user-friendly setup, and warranty coverage make it a reliable and worthwhile investment. With the addition of some ergonomic enhancements, this monitor could easily earn a solid 5-star rating. If you seek an engaging and visually appealing desktop monitor, the Samsung CF390 Series is definitely one to consider."
    },
    {
        "Author": "Jerry Long",
        "Date": "Reviewed in the United States on July 26, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "I have 3 of these the look at work great!"
    },
    {
        "Author": "Ugobekee",
        "Date": "Reviewed in the United States on July 13, 2023",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "No volume? What do I do?"
    },
    {
        "Author": "Dino",
        "Date": "Reviewed in the United States on July 9, 2023",
        "Rating": "2.0 out of 5 stars",
        "Review Body": "Love how it looks but was missing the power cord to it"
    },
    {
        "Author": "Diverjay",
        "Date": "Reviewed in the United States on July 8, 2023",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "I didn't get the same monitor that was pictured (stand is different). Still, it is a very nice monitor for the price and even came with an HDMI cable."
    },
    {
        "Author": "Isabel Alonso",
        "Date": "Reviewed in the United States on July 6, 2023",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "The monitor doesn't show beautiful colors. It shows low resolution. It was a mistake to buy it. Now I can't return it"
    },
    {
        "Author": "K",
        "Date": "Reviewed in the United States on June 13, 2023",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "I bought this monitor specifically because I get migraines and am very light-sensitive. I loved that it has an eye-saver mode. However…. It was a bit too bright for me with it on, and I couldn’t reduce the brightness. I ended up turning off the eye-saver mode and just using it on lower brightness. It’s a nice monitor, but I really really really wish I could both have eye-saver on and dim brightness at the same time."
    },
    {
        "Author": "Ron Boggs",
        "Date": "Reviewed in the United States on June 10, 2023",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "Nice picture but have to pull hdmi cord out and in back of monitor everytime i start pc from sleep mode to get it to show picture."
    },
    {
        "Author": "Henry",
        "Date": "Reviewed in the United States on June 9, 2023",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "The monitor is not working and all black when connected to computer.I want to request return and refund.  My email is singularity2091@gmail.com.  Please contact me as I know samsung is a good brand.  Please process refund, thank you."
    },
    {
        "Author": "Roger Kuchenmeister",
        "Date": "Reviewed in the United States on May 27, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "X"
    },
    {
        "Author": "Public Name (required)",
        "Date": "Reviewed in the United States on May 21, 2023",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "Its a nice monitor for the price point. Would have liked the legs instead of the round base but it may be because of the jiggly issues Ive read in reviews.  They may have done away with the legs because of weakness.Should be tiltable though."
    },
    {
        "Author": "David Burkhart",
        "Date": "Reviewed in the United States on May 12, 2023",
        "Rating": "2.0 out of 5 stars",
        "Review Body": "The picture quality if good, but be aware that these monitors (I bought two) make an audible electronic whining noise while on which becomes quite annoying after a few minutes. Nothing I've done or changed seems to make it go away except turning them off, which does not make them a terribly useful monitor then."
    },
    {
        "Author": "Jeffrey Tomczak",
        "Date": "Reviewed in the United States on May 8, 2023",
        "Rating": "3.0 out of 5 stars",
        "Review Body": "Monitor looks good, and sets up easy.  However, the screen had a dark spot (about the size of a pencil eraser) where the pixels were not working.  Returned the product promptly and was given a full refund.....which is why I keep using Amazon.  If it isn't right, they fix it!"
    },
    {
        "Author": "Alyssa Thomas",
        "Date": "Reviewed in the United States on May 4, 2023",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "I was so excited to get this monitor. I should've listened to the 1 star this monitor came blurry. I have a mac and thought maybe that was the problem. I then tried it on my PC and it didn't work either. I am going to need a refund for this product. If you are reading this, don't buy it."
    },
    {
        "Author": "C. Vickers",
        "Date": "Reviewed in the United States on April 16, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Works like a dream, I want a second one really bad. I will definitely be purchasing one once I get the chance. Easy to use, the base once locked in is very stable. And hard to remove. Computer detected it right away, no issues whatsoever."
    },
    {
        "Author": "L.L",
        "Date": "Reviewed in the United States on March 30, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Love my new work monitors. They are perfect all around."
    },
    {
        "Author": "cheryl",
        "Date": "Reviewed in the United States on March 21, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Nice, glad I purchased it!"
    },
    {
        "Author": "Jas",
        "Date": "Reviewed in the United States on March 16, 2023",
        "Rating": "3.0 out of 5 stars",
        "Review Body": "Price and speed of shipping were great. I’m incredibly disappointed that the monitor for my home office came defective."
    },
    {
        "Author": "Mikah B.",
        "Date": "Reviewed in the United States on March 7, 2023",
        "Rating": "2.0 out of 5 stars",
        "Review Body": "The good: curve is nice, screen appearance is good, but they make noise (with different colors/images for some reason) and seem extremely sensitive to static discharge.  I replaced two older ACER 27\" monitors with these when one finally died.  All other components/cables stayed the same, now I have monitors that have a high-pitched squeal sometimes and often flicker off when I stand up, move around.  Not the end of the world, and the image quality is good, but certainly not a home run either.EDIT: The ESV sensitivity turned out to be some DP->HDMI adapters I had on the monitors.  Swapping those out for newer ones solved that 100%.  I still have a huge level of capacitor noise from them, though, which I cannot understand why nobody else is mentioning.  If I hadn't gotten 2 with identical behavior I'd think it was a parts problem, but seems like I should've returned these quickly and gone another route.EDIT2: Having owned these 2 monitors for over a year now, the noise issue has just been ongoing and it blows me away how bad it is/was.  Last night I was actually getting a headache from the nonstop high-pitched noise, so much so that I decided I was just going to trash these year-old monitors and replace them.  But, I spent about 20 minutes fiddling with every setting and FINALLY found a random combination of values that actually reduced the noise to barely perceptible.  While it's a relief to be able to be in front of these comfortably now, it still blows me away that ANY modern, brand-name monitor has any scenario where it's generating so much terrible electronic noise."
    },
    {
        "Author": "Mark D. Stephens",
        "Date": "Reviewed in the United States on March 6, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "I used them in pair and effect is very nice.  Careful with them (they are very thin) if you move them, put it back in box or else easily pressure cracked."
    },
    {
        "Author": "Chendra",
        "Date": "Reviewed in the United States on March 6, 2023",
        "Rating": "3.0 out of 5 stars",
        "Review Body": "Monitor looks good, unfortunately dead pixel vertical line appears on the second day use. Returned it for replacement."
    },
    {
        "Author": "Jazmine",
        "Date": "Reviewed in the United States on March 2, 2023",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "Stopped working after 4 years. I think I may have a defective one because many times the screen would not cut on when the cpu would  power on. Always had to unplug/replug the power supply into the monitor for it to cut onI use the same model monitor at my church and it works fine. I probably should have returned mine at the first sign of defect."
    },
    {
        "Author": "Sky Saunders",
        "Date": "Reviewed in the United States on February 26, 2023",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "The monitor with the display port in the back, it looks like a sister to HDMI. I got sent the other. Hence the missing star. I love it otherwise."
    },
    {
        "Author": "Palmer",
        "Date": "Reviewed in the United States on February 24, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Work well, no complaints."
    },
    {
        "Author": "R Clark",
        "Date": "Reviewed in the United States on February 19, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Just about the right size for desktop monitor and real nice picture. Had choice of VGA cable or HDMI worked perfectly right of the box!"
    },
    {
        "Author": "RAMIRO BUENO",
        "Date": "Reviewed in the United States on January 26, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "el producto como lo pedi"
    },
    {
        "Author": "John Bellegante",
        "Date": "Reviewed in the United States on January 17, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "two of these and flat screen in the middle, looks good."
    },
    {
        "Author": "Shadowfriend",
        "Date": "Reviewed in the United States on January 8, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Easy to assemble"
    },
    {
        "Author": "Daviducc",
        "Date": "Reviewed in the United States on January 7, 2023",
        "Rating": "3.0 out of 5 stars",
        "Review Body": "It gets a pink screen when turning on.Also getting random lines that come and go.Less than a month old. Overall, if you don’t mind restarting the monitor (I do- about 4-5 times a day), it’s an OK one."
    },
    {
        "Author": "Cheryl J",
        "Date": "Reviewed in the United States on January 3, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "I have an additional monitor at the office  so I can have an addtional window or browser open.  I wanted to duplicate my office set up at home so I purchased this monitor. The screen is clear and crisp and a good size.  it was reasonably priced and I didnt have any difficulty setting it up and connecting it to my laptop.  I recommend this if you are looking for an additonal monitir to use at home"
    },
    {
        "Author": "F. Santander",
        "Date": "Reviewed in the United States on December 31, 2022",
        "Rating": "3.0 out of 5 stars",
        "Review Body": "I bought this as an extended monitor and to enjoy viewing content on a curved screen. It all started well until it lost its low light visibility and, after calling to pursue the warranty repair ... bait and switch ... SAMSUNG said it was actually a 1 year not a 3 year warranty ...I'm out of luck and out of pocket if I wish to pursue remedy. Greaaaaaat but nevermind SAMSUNG"
    },
    {
        "Author": "Rip",
        "Date": "Reviewed in the United States on December 28, 2022",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "I was buying this so I would have two identical monitors. Same product SKU, and the photo showed it was the item I wanted, but when I received it, it had a different stand than my other monitor. Instead of the forked, cantilevered stand depicted in the photo, it had a flat disk."
    },
    {
        "Author": "Amazon Customer",
        "Date": "Reviewed in the United States on December 27, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "I bought this for my nephew because he is in music engineering in college. This is the monitor he had been wanting. The picture  quality and the and screen is perfect! He loves it!"
    },
    {
        "Author": "Dave52",
        "Date": "Reviewed in the United States on December 26, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Easy to install and fast. Fabulous picture and I love the screen size."
    },
    {
        "Author": "Walyn",
        "Date": "Reviewed in the United States on December 23, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "The media could not be loaded."
    },
    {
        "Author": "Marconelli",
        "Date": "Reviewed in the United States on December 19, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "This is a gorgeous monitor at a very attractive price. I can't speak to its use as a gaming monitor, as I use it for general computing (email, web-browsing, docx and pdf file creation, YouTube and streaming video, etc.), but for my purposes it is wonderful. The curved screen is a real plus, especially at this large image size, and it's a breeze to set up on a Windows 10 computer.A word of advice: the base of this monitor is different from the one shown in the Amazon ad. As you can see in the accompanying photo, the base is round, rather than the winged version that Amazon displays in its ad. (There are other models in the CF390 series that have the winged base, but not this one.) I was actually happy about that mismatch, as the round base seems preferable to me -- it takes up less room on my desktop.Note also that the printed documentation that comes with this monitor is meager, at best. There is little there but some hard-to-interpret ideograms for setting it up (with accompanying text in English, French, Spanish, and Portuguese), and a brochure explaining the (to my mind, useless) \"Eye-Saver Mode\" in 34 different languages. Seriously!What's missing is any instruction on the use of the \"joy-stick\" control on the back of the monitor, which is an all-purpose control for setting brightness, contrast, display mode, on-off, etc. It's pretty intuitive, but still, there should be something. Fortunately, there is a downloadable PDF at the Samsung website that is more like a proper user's guide. But even that does not discuss the use of the joy-stick. What is it with the people who write documentation for tech products?But enough griping. This is a magnificent monitor at a very attractive price. I just love it."
    },
    {
        "Author": "J. Kent Rountree",
        "Date": "Reviewed in the United States on December 14, 2022",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "The photo of the back in the description for this monitor clearly shows a DisplayPort. I ordered two of these along with DisplayPort cables.The monitors I received only have HDMI and VGA connections on the back. This is a huge inconvenience since the hub I am connecting to only has DisplayPort connections. Now I have to send the cables back and get new ones."
    },
    {
        "Author": "CWB",
        "Date": "Reviewed in the United States on December 12, 2022",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "Plenty has been said about this monitor. The only thing I wish it had was both HDMI & DataPort. I had to buy a DataPort-> HDMI adapter as my Lenovo dock only has a single HDMI and 2 DataPorts, and this monitor has only an HDMI & VGA. The adapter was only $8.20.  I know, I know, it's a low cost monitor (I paid $149 w/Prime free shipping). How much extra would it cost to have both ports?SUGGESTION: Rather than a HDMI & VGA, why not a HDMI and Dataport, and those who need VGA can buy an adapter? There are far more monitors with HDMI & Dataport than VGA in 2022.This is a only a minor nit."
    },
    {
        "Author": "alexis",
        "Date": "Reviewed in the United States on December 10, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "THE BEST"
    },
    {
        "Author": "Crooks",
        "Date": "Reviewed in the United States on December 9, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "My job requires multiple displays due to the large amounts of information I must track at once. This curved display fits in nicely with my other monitors. I used a VESA mount to secure it to the Walli mounts I already had. Highly recommend."
    },
    {
        "Author": "Ian Wertlieb",
        "Date": "Reviewed in the United States on December 8, 2022",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "I’m a broke college student who likes to use a monitor for school work and gaming. Got the monitor and it looks nothing like the one in the image. Secondly, the VGA port doesn’t work, so I have to manually switch out the HDMI for my PS4 and laptop in the single HDMI port it has. So annoying.Really feel like I got scummed here. Regardless the video quality is poor too. Just spend the extra 50 or so dollars and get a nicer one. Cheers."
    },
    {
        "Author": "Sreeram",
        "Date": "Reviewed in the United States on November 30, 2022",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "This and other samsung monitors have worst design when it comes to removing the base stand. You have to take out the back pane completely with all the flimsy plastic with a pretty high chance of breaking it… just DUMB design"
    },
    {
        "Author": "Park502",
        "Date": "Reviewed in the United States on November 29, 2022",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "The product images show that there is a Display port (DP) which is what I need and why I purchased this. It actually has a VGA port instead of a display port. When I double checked, the product description says VGA but the product image shows Display Port. Now I have to figure out how to return this."
    },
    {
        "Author": "Richard Jensen",
        "Date": "Reviewed in the United States on November 22, 2022",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "So, now I get to track down how to get support from Samsung. I purchased two of these four months ago, and one of them just died today. Totally dead. Swapping power supplies didn't work. The monitor itself has no indication that it's connected to power, and it won't turn on or display anything.Samsung's quality control has pitched off the cliff over the past few years. I would NEVER buy any appliance from them, and I recently had a TV from the die as well. So, even in their traditional wheelhouse, TVs and monitors, they have become completely unreliable.Time to start trying out other brands again. Samsung has totally lost me as a customer at this point. I don't have time in my life to play these games."
    },
    {
        "Author": "Mr perfect",
        "Date": "Reviewed in the United States on November 15, 2022",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "Don't buy. Got 3 yr warranty. They give you no proof. Woot said ask amazon amazon said ask woot.I spend a lot of money with amazon with subscription and items. Bad amazon sell of this product"
    },
    {
        "Author": "D Mobley",
        "Date": "Reviewed in the United States on November 9, 2022",
        "Rating": "3.0 out of 5 stars",
        "Review Body": "The description said that it was a business monitor and that it had a 3 year warranty but when I called the Samsung help line to report an issue, they said that it had a one year warranty and that it was not a business monitor, therefore, they would not fix it."
    },
    {
        "Author": "C. Rosselli",
        "Date": "Reviewed in the United States on November 4, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "I have two monitors on my desktop and I love that the slightly curved Samsung lets me move around in my desk chair and see it at any angle.  I just bought one for my daughter for Xmas.  Great monitor for the price."
    },
    {
        "Author": "Amazon Customer",
        "Date": "Reviewed in the United States on October 22, 2022",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "The stand won’t connect with monitor don’t buy"
    },
    {
        "Author": "Mayank Tyagi",
        "Date": "Reviewed in the United States on October 12, 2022",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "I would have given this monitor full 5 stars if it would have had an in built speaker. Apart from that its a great product from Samsung. has a night light mode thats easier on the eyes, picture quality is great."
    },
    {
        "Author": "Hunter Davis",
        "Date": "Reviewed in the United States on October 11, 2022",
        "Rating": "4.0 out of 5 stars",
        "Review Body": "I would say that if you are on a budget this is the screen for you. The great size and curve are nice, but not too much. It is cheap and not the best-looking screen I have used but for movies and tv, I would totally recommend it. I do game on it a bit and I would say it is 100% usable and good for any small space that you are looking to fit it in."
    },
    {
        "Author": "sam",
        "Date": "Reviewed in the United States on October 10, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Out of the box it was easy to set up and connect, everything is functional, and the ULTRA CURVED SCREEN gives an aspect Ratio 16:9 and displays images in dark blacks, vivid colors, and sharp details with a high-quality picture. Only issue was with Samsung, they did not want to gie me the 3-year warranty. I had to request the seller The Minerva Project to contact Samsung to correct and update the 9 month warranty Samsung gave me to the 3- year warranty. Still waiting to see if Samsung stands behind their 3-year warranty as advertised."
    },
    {
        "Author": "Amazon Customer",
        "Date": "Reviewed in the United States on October 1, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Product arrived with a crack down middle of screen"
    },
    {
        "Author": "Gevorg Sargsyan",
        "Date": "Reviewed in the United States on September 29, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Worth every penny"
    },
    {
        "Author": "SillyGrl",
        "Date": "Reviewed in the United States on September 26, 2022",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "Beautiful color and picture - however it fried my mother board - twice. I don't recommend for a PC"
    },
    {
        "Author": "Amazon Customer",
        "Date": "Reviewed in the United States on September 22, 2022",
        "Rating": "3.0 out of 5 stars",
        "Review Body": "It is way too difficult to take off the stand and mount the screen. You have to take apart the whole monitor just to remove the stand. Samsung please come up with a simpler solution to take off stand without taking apart the whole monitor. Too many opportunities to mess up the wiring and display."
    },
    {
        "Author": "Amazon Customer",
        "Date": "Reviewed in the United States on September 19, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "The monitor is very resourceful of doing my son’s assignment like using Microsoft office."
    },
    {
        "Author": "Don",
        "Date": "Reviewed in the United States on September 16, 2022",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "Monitor works roughly half the time. Does not recognize HDMI input and screen stays black even though my computer says it’s connected. Incredibly frustrating. Wouldn’t recommend."
    },
    {
        "Author": "Kevon Gordon",
        "Date": "Reviewed in the United States on September 14, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "It’s good money"
    },
    {
        "Author": "Megan T",
        "Date": "Reviewed in the United States on September 3, 2022",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "The monitor pictured in the listing has a slim v shaped stand. I purchased the monitor specifically to have it be an exact match to one I already own. What was delivered has a round stand. Completely unhappy with the misrepresentation!"
    },
    {
        "Author": "Amazon Customer",
        "Date": "Reviewed in the United States on August 29, 2022",
        "Rating": "3.0 out of 5 stars",
        "Review Body": "I love the curved monitor, no glare, looks really nice!  But, two things could be a lot better:1) The rear mount that attaches the base does not come off.  This is now a random piece of plastic hanging off the bottom of an arm-mounted monitor which makes no sense.  If it's compatible with an adjustable arm mount, why would the plastic arm for the desktop base not come off?  Just make it removable with some screws or snaps or something!2) It scratches really easily.  I have two permanent scratches where something accidentally bumped the screen and left a mark that seems to be permanent and won't wipe off.  If you're a really careful person, this might not be an issue, but god forbid you swat a fly and hit the screen by accident, you'll be staring at that mark for the rest of the life of the monitor."
    },
    {
        "Author": "David L. Morgan",
        "Date": "Reviewed in the United States on August 24, 2022",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "Nice picture while it lasted. Samsung support was little help. Apparently because it was manufactured in Mexico US customer support transferred me to their Latin American help line but there was no option for English speakers on the line I was transferred to so I gave up trying to get a repair. Item had a 3 yr warranty."
    },
    {
        "Author": "bowserbob",
        "Date": "Reviewed in the United States on August 9, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Never ever have seen such a clear picture vivid colors yet dont hurt the eyes"
    },
    {
        "Author": "Pete C",
        "Date": "Reviewed in the United States on August 9, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "This Samsung monitor offers a nice picture and doesn't take up much desk space.  For the money it is a great monitor from a name brand."
    },
    {
        "Author": "Rick",
        "Date": "Reviewed in the United States on August 8, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Replaced older 27\" LG monitor with this one, really a big difference. Curved screen makes viewing more comfortable. Only drawback is the base doesn't tilt or adjust, but you can't beat the price."
    },
    {
        "Author": "Maureen A McGehee",
        "Date": "Reviewed in the United States on August 7, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Didn’t know if I would like it. It’s great!"
    },
    {
        "Author": "Evan",
        "Date": "Reviewed in the United States on August 4, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "This was purchased for my assistant because she was used to using the larger monitors for work. She really likes it. You are able to have two separate documents opened up on the screen which is really helpful for our line of work. Glad we purchased her the bigger size from what we had been using."
    },
    {
        "Author": "Daniel Ruiz",
        "Date": "Reviewed in the United States on July 25, 2022",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "The picture shown is not what you get.. I was looking for an specific connection for my pc, and the picture show a display port that was the Type of connection I was lookiing for but it came with HDMI. Also the monitor base is totally different"
    },
    {
        "Author": "Nicholas DeLong",
        "Date": "Reviewed in the United States on July 18, 2022",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "I have tried two monitors now to try and get one that will match the original monitor that was purchased.  The new monitors have the same display settings and can not get the screen to match the original screen.  This is very frustrating as these are used right next to one another and the new one has a yellow tint.  This seems to be a problem with the white black balance.  Trying to get support on this but can not reach the supplier!!"
    },
    {
        "Author": "D. Hanks",
        "Date": "Reviewed in the United States on July 17, 2022",
        "Rating": "3.0 out of 5 stars",
        "Review Body": "I really liked the monitor, but it didn't last very long. A few months after I bought it, I was working on my computer and the monitor went off, and I was never able to get it to come back on."
    },
    {
        "Author": "The Dude too",
        "Date": "Reviewed in the United States on July 14, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Excellent monitor and good customer service"
    },
    {
        "Author": "Winterbark",
        "Date": "Reviewed in the United States on July 14, 2022",
        "Rating": "3.0 out of 5 stars",
        "Review Body": "ok, i already have another monitor dedicated to Gaming. this monitor will be specifically used for internet windows and some videos. my MAJOR complaint is how you MUST remove the back panel to remove the desk mount. that is NEVER noted or explained in the directions in any way, you have to google it.  aside from that i am pleased with the monitor so far. i STRONGLY advise you to cut the brightness down to 50%. that 100% is enough to be a flashlight  in your face in a dark room once you open google.  there are no intuitive controls, the power button is a directional pad/button. so that took a minute to figure out. i will likely be getting a second unit to accent the build and offer more screen space. TECHNICALLY this is a 24 inch resolution stretched to a 27 inch screen, so YOU WILL see some minor distortion and maybe some fuzzy print. you will have to alter that via the setting available in  the unit, or through the GPU software settings.i am usually pleased with Samsung products, so i am happy that this monitor keep the expectations."
    },
    {
        "Author": "donba27",
        "Date": "Reviewed in the United States on July 1, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "To start I have only had the monitor for a week. It’s an upgrade from a 6 year old Asus 23” monitor. I’m using it with an ABS computer equipped with a 3.40 gigahertz AMD Ryzen 5 2600 Six-Core processor with 16gb Ram.  It has an NVIDIA GeForce GTX 1660 Display adapter.The display is crystal clear and a major improvement from the 23” Asus and I love the curved screen. Picture quality is outstanding and text very easy to read. All in all, a great monitor for the price.ConsThe setup instructions suck, but I was able to figure it out and complete the install.The control button is on the lower right back of the monitor and can be a bit of a hassle machining changes.  The middle of the button acts as a toggle switch to control left/right and top/bottom options and takes a bit to get use to."
    },
    {
        "Author": "David Ly",
        "Date": "Reviewed in the United States on June 22, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "No issue."
    },
    {
        "Author": "Lori Coleman-Peck",
        "Date": "Reviewed in the United States on June 7, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Easy to setup and use."
    },
    {
        "Author": "Jeffrey R. Larson",
        "Date": "Reviewed in the United States on May 24, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Great customer service, beautiful product"
    },
    {
        "Author": "Joseph Gracia",
        "Date": "Reviewed in the United States on May 24, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Great screen size and great picture quality. The curve is pleasing to the eye and it makes work less stress on my eyes. Recommend this monitor, 5 stars!"
    },
    {
        "Author": "Amos K Ebersol",
        "Date": "Reviewed in the United States on May 11, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "So far this screen is great"
    },
    {
        "Author": "A Customer",
        "Date": "Reviewed in the United States on May 6, 2022",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "Product sis not las"
    },
    {
        "Author": "Gee",
        "Date": "Reviewed in the United States on May 2, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "I got this monitor back in 2019 for $208, and it's served me extremely well for the past few years. I primarily used it to extend the display on my 2011 Toshiba laptop during that time. 1080p was perfect, because my laptop wasn't really capable of anything more than that. I did have a recurring issue with the display sometimes not turning on after my laptop wakes up from sleep. I would have to manually unplug the monitor, wait a few seconds, and plug it back in...that got kind of annoying, but it was still great besides that!Don't get this monitor expecting a great picture if you connect it to a Mac, or any newer computer for that matter. It's native resolution is 1080p, not 4k. As some other reviewers have mentioned, if you connect it to a newer machine, you'll really notice the lack of resolution in the text."
    },
    {
        "Author": "Kevin K.",
        "Date": "Reviewed in the United States on April 28, 2022",
        "Rating": "1.0 out of 5 stars",
        "Review Body": "One of two monitors was defective and I couldn't send it back because I couldn't get the stand off and pack it in the original box as required. Trashed it."
    },
    {
        "Author": "Victor Espinal",
        "Date": "Reviewed in the United States on April 28, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "The monitor is very practical and usefull for homework. Image is very clear and brilliant."
    },
    {
        "Author": "Bonita Fuller",
        "Date": "Reviewed in the United States on April 19, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Perfect"
    },
    {
        "Author": "amanda vaughan",
        "Date": "Reviewed in the United States on April 15, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "First of all this is the first product I’ve ever ever ever reviewed! Only because after reading all of the previous reviews, I was skeptical. I have been in need of making a home office, but did not wanna replace my 2015 MacBook Pro, because I spent so much money on it! I needed an external screen, so that I would not have back and shoulder pain, looking down all day. At first, when I plug in my HDMI cables, I was so disappointed because I could only see the background of my MacBook Pro. I could not see it in real time. Then I was able to research another review that explained to go into display settings under apple menu. That was a game changer! I follow those directions, and my picture is unbelievably clear! If I need a second external screen, I will definitely buy this one again. Kudos!"
    },
    {
        "Author": "A. Salomon",
        "Date": "Reviewed in the United States on April 14, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review Body": "Great for the price. Wish it had adjustable screen."
    }
]